---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ReloadBeforeMakeEditable
source: html/6f509a7b-3605-27f5-f6e7-3454d95551d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ReloadBeforeMakeEditable Property

You must Reload Latest before editing the element.

## Syntax (C#)
```csharp
public static FailureDefinitionId ReloadBeforeMakeEditable { get; }
```